---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarContainerItem.IsRebarInSection(Autodesk.Revit.DB.View)
source: html/8ba6812e-6cbf-1383-48e0-02630d3b1e6c.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.IsRebarInSection Method

Identifies if this rebar set is shown as a cross-section in the given view.

## Syntax (C#)
```csharp
public bool IsRebarInSection(
	View dBView
)
```

## Parameters
- **dBView** (`Autodesk.Revit.DB.View`) - The view.

## Returns
True if this rebar set is shown as a cross-section, false otherwise.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null